templator_text.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-11 Mon 14:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TEXT back end</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX-CoE" />
<link rel="stylesheet" title="Standard" href="trexio.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">TEXT back end</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org175eeae">1. Template for group-related structures in text back end</a></li>
<li><a href="#org26d537d">2. Template for general structure in text back end</a></li>
<li><a href="#orgd3ced33">3. Initialize function (constant part)</a></li>
<li><a href="#orga1668b7">4. Deinitialize function (templated part)</a></li>
<li><a href="#org91901ac">5. Template for text read a group</a></li>
<li><a href="#org01ace0c">6. Template for text has a group</a></li>
<li><a href="#org88164a6">7. Template for text flush a group</a></li>
<li><a href="#orgcc7ec18">8. Template for text free memory</a></li>
<li><a href="#org9935293">9. Template for has/read/write a numerical attribute</a></li>
<li><a href="#orgd29455d">10. Template for has/read/write a dataset of numerical data</a></li>
<li><a href="#org86329f2">11. Template for has/read/write a dataset of strings</a></li>
<li><a href="#org7418499">12. Template for has/read/write a string attribute</a></li>
<li><a href="#org1da7d57">13. Template for has/read/write the dataset of sparse data</a></li>
<li><a href="#orgf96d954">14. Template for text delete a group (UNSAFE mode)</a></li>
<li><a href="#orga56afa2">15. Source code for the determinant part</a></li>
</ul>
</div>
</div>
<p>
The "file" produced by the text back end is a directory with one
file per group.
</p>

<p>
When the file is open, it is locked by the current process. No other
process can read/write the same file. This guarantees that the
representation in memory is consistent with the file and avoid
re-reading the file before writing.
To lock the file, we lock the <code>.lock</code> file which is present in the
directory.
</p>

<p>
The file is written when closed, or when the flush function is called.
</p>

<div id="outline-container-org175eeae" class="outline-2">
<h2 id="org175eeae"><span class="section-number-2">1</span> Template for group-related structures in text back end</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> $group$_s {
  $group_num_dtype_double$ $group_num$;
  $group_dset_dtype$*  $group_dset$;
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dims_$group_dset$</span>[16];
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">len_$group_str$</span>;
  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank_$group_dset$</span>;
  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">to_flush</span>;
  bool $group_num$_isSet;
  <span style="color: #228b22;">char</span>*    $group_str$;
  <span style="color: #228b22;">char</span>     <span style="color: #a0522d;">file_name</span>[TREXIO_MAX_FILENAME_LENGTH];
} $group$_t;
</pre>
</div>
</div>
</div>

<div id="outline-container-org26d537d" class="outline-2">
<h2 id="org26d537d"><span class="section-number-2">2</span> Template for general structure in text back end</h2>
<div class="outline-text-2" id="text-2">
<p>
Polymorphism of the <code>trexio_t</code> type is handled by ensuring that the
corresponding types for all back ends can be safely casted to
<code>trexio_t</code>. This is done by making the back-end structs start with
<code>trexio_t parent</code> attribute:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">trexio_text_s</span> {
  <span style="color: #228b22;">trexio_t</span>   <span style="color: #a0522d;">parent</span> ;
  $group$_t* $group$;
  <span style="color: #228b22;">int</span>        <span style="color: #a0522d;">lock_file</span>;
} <span style="color: #228b22;">trexio_text_t</span>;
</pre>
</div>
</div>
</div>
