templator_text.html

<div id="outline-container-orgd3ced33" class="outline-2">
<h2 id="orgd3ced33"><span class="section-number-2">3</span> Initialize function (constant part)</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span>
<span style="color: #0000ff;">trexio_text_file_exists</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">file_name</span>)
{
  /* <span style="color: #b22222;">Check if the file with "file_name" exists </span>*/
  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">stat</span> <span style="color: #a0522d;">st</span>;

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span> = stat(file_name, &amp;st);

  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">file_exists</span> = rc == 0;

  <span style="color: #a020f0;">return</span> file_exists;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_inquire</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">file_name</span>)
{
  /* <span style="color: #b22222;">Check if the file with "file_name" exists and that it is a directory </span>*/
  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">stat</span> <span style="color: #a0522d;">st</span>;

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span> = stat(file_name, &amp;st);

  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">file_exists</span> = rc == 0;

  <span style="color: #a020f0;">if</span> (file_exists) {

    <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">is_a_directory</span> = <span style="color: #008b8b;">false</span>;
<span style="color: #483d8b;">#ifdef</span> S_IFDIR
    is_a_directory = st.st_mode &amp; S_IFDIR;
<span style="color: #483d8b;">#elif</span> S_ISDIR
    is_a_directory = S_ISDIR(s.st_mode);
<span style="color: #483d8b;">#else</span>
    printf(<span style="color: #8b2252;">"Some important macros are missing for directory handling.\n"</span>);
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
<span style="color: #483d8b;">#endif</span>
    <span style="color: #a020f0;">if</span> (!is_a_directory) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_init</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_text_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_text_t</span>*) file;

  /* <span style="color: #b22222;">Put all pointers to NULL but leave parent untouched </span>*/
  memset(&amp;(f-&gt;parent)+1,0,<span style="color: #a020f0;">sizeof</span>(trexio_text_t)-<span style="color: #a020f0;">sizeof</span>(trexio_t));

  /* <span style="color: #b22222;">Check if directory exists </span>*/
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;
  rc = trexio_text_inquire(file-&gt;file_name);
  /* <span style="color: #b22222;">TREXIO file exists but is not  a directory </span>*/
  <span style="color: #a020f0;">if</span> (rc == TREXIO_FILE_ERROR) <span style="color: #a020f0;">return</span> rc;
  /* <span style="color: #b22222;">If directory does not exist - create it in write mode </span>*/
  <span style="color: #a020f0;">if</span> (rc == TREXIO_FAILURE) {

    <span style="color: #a020f0;">if</span> (file-&gt;mode == <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">return</span> TREXIO_READONLY;

    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc_dir</span> = mkdir(file-&gt;file_name, 0777);
    <span style="color: #a020f0;">if</span> (rc_dir != 0) <span style="color: #a020f0;">return</span> TREXIO_ERRNO;

  }

  /* <span style="color: #b22222;">Create the lock file in the directory </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">lock_file_name</span> = <span style="color: #8b2252;">"/.lock"</span>;

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_name</span>[TREXIO_MAX_FILENAME_LENGTH];

  strncpy (file_name, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  strncat (file_name, lock_file_name, TREXIO_MAX_FILENAME_LENGTH-strlen(lock_file_name));

  <span style="color: #a020f0;">if</span> (file_name[TREXIO_MAX_FILENAME_LENGTH-1] != <span style="color: #8b2252;">'\0'</span>) {
    <span style="color: #a020f0;">return</span> TREXIO_LOCK_ERROR;
  }

  f-&gt;lock_file = open(file_name,O_WRONLY|O_CREAT|O_TRUNC, 0644);

  <span style="color: #a020f0;">if</span> (f-&gt;lock_file &lt;= 0) {
    <span style="color: #a020f0;">if</span> (file-&gt;mode != <span style="color: #8b2252;">'r'</span>) {
      <span style="color: #a020f0;">return</span> TREXIO_ERRNO;
    } <span style="color: #a020f0;">else</span> {
      <span style="color: #a020f0;">if</span> (errno == EACCES) {
        /* <span style="color: #b22222;">The directory is read-only and the lock file can't be written.</span>
<span style="color: #b22222;">          Create a dummy temporary file for dummy locking.</span>
<span style="color: #b22222;">        </span>*/
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">dirname</span>[TREXIO_MAX_FILENAME_LENGTH] = <span style="color: #8b2252;">"/tmp/trexio.XXXXXX"</span>;
        <span style="color: #a020f0;">if</span> (mkdtemp(dirname) == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ERRNO;
        strncpy (file_name, dirname, TREXIO_MAX_FILENAME_LENGTH);
        strncat (file_name, lock_file_name, TREXIO_MAX_FILENAME_LENGTH-strlen(lock_file_name));
        f-&gt;lock_file = open(file_name,O_WRONLY|O_CREAT|O_TRUNC, 0644);
        remove(file_name);
        rmdir(dirname);
      } <span style="color: #a020f0;">else</span> {
        <span style="color: #a020f0;">return</span> TREXIO_ERRNO;
      }
    }
  }

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_lock</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>) {
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_text_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_text_t</span>*) file;

  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">flock</span> <span style="color: #a0522d;">fl</span>;

  fl.l_type   = F_WRLCK;
  fl.l_whence = SEEK_SET;
  fl.l_start  = 0;
  fl.l_len    = 0;
  fl.l_pid    = getpid();

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span> = fcntl(f-&gt;lock_file, F_SETLKW, &amp;fl);
  <span style="color: #a020f0;">if</span> (rc == -1) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_unlock</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_text_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_text_t</span>*) file;

  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">flock</span> <span style="color: #a0522d;">fl</span>;

  fl.l_type   = F_UNLCK;
  fl.l_whence = SEEK_SET;
  fl.l_start  = 0;
  fl.l_len    = 0;
  fl.l_pid    = getpid();
  fcntl(f-&gt;lock_file, F_SETLK, &amp;fl);

  close(f-&gt;lock_file);
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1668b7" class="outline-2">
<h2 id="orga1668b7"><span class="section-number-2">4</span> Deinitialize function (templated part)</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_deinit</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;

  /* <span style="color: #b22222;">Error handling for this call is added by the generator </span>*/
  rc = trexio_text_free_$group$( (<span style="color: #228b22;">trexio_text_t</span>*) file);

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

}
</pre>
</div>
</div>
</div>
