templator_text.html

<div id="outline-container-org91901ac" class="outline-2">
<h2 id="org91901ac"><span class="section-number-2">5</span> Template for text read a group</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-c">$group$_t*
trexio_text_read_$group$ (<span style="color: #228b22;">trexio_text_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;

  /* <span style="color: #b22222;">If the data structure exists, return it </span>*/
  <span style="color: #a020f0;">if</span> (file-&gt;$group$ != <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> file-&gt;$group$;
  }

  /* <span style="color: #b22222;">Allocate the data structure </span>*/
  $group$_t* $group$ = MALLOC($group$_t);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;

  memset($group$,0,<span style="color: #a020f0;">sizeof</span>($group$_t));

  /* <span style="color: #b22222;">Build the file name </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* $group$_file_name = <span style="color: #8b2252;">"/$group$.txt"</span>;

  strncpy ($group$-&gt;file_name, file-&gt;parent.file_name, TREXIO_MAX_FILENAME_LENGTH);
  strncat ($group$-&gt;file_name, $group$_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen($group$_file_name));

  <span style="color: #a020f0;">if</span> ($group$-&gt;file_name[TREXIO_MAX_FILENAME_LENGTH-1] != <span style="color: #8b2252;">'\0'</span>) {
    FREE($group$);
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  }

  /* <span style="color: #b22222;">If the file exists, read it </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen($group$-&gt;file_name,<span style="color: #8b2252;">"r"</span>);
  <span style="color: #a020f0;">if</span> (f != <span style="color: #008b8b;">NULL</span>) {

    /* <span style="color: #b22222;">Find size of file to allocate the max size of the string buffer </span>*/
    fseek(f, 0L, SEEK_END);
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">sz</span> = ftell(f);
    fseek(f, 0L, SEEK_SET);

    sz = (sz &lt; 1024) ? (1024) : (sz);
    <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">buffer</span> = CALLOC(sz, <span style="color: #228b22;">char</span>);
    <span style="color: #a020f0;">if</span> (buffer == <span style="color: #008b8b;">NULL</span>) {
      fclose(f);
      FREE($group$);
      <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
    }

    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span> = 0;
    <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc_free</span> = TREXIO_FAILURE;

    /* <span style="color: #b22222;">workaround for the case of missing blocks in the file </span>*/
    // <span style="color: #b22222;">START REPEAT GROUP_DSET_ALL</span>
    <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">size_$group_dset$</span> = 0;
    // <span style="color: #b22222;">END REPEAT GROUP_DSET_ALL</span>

    <span style="color: #a020f0;">while</span>(fscanf(f, <span style="color: #8b2252;">"%1023s"</span>, buffer) != EOF) {

      <span style="color: #a020f0;">if</span> (strcmp(buffer, <span style="color: #8b2252;">"EXIT"</span>) == 0) {
        <span style="color: #a020f0;">break</span>;
      // <span style="color: #b22222;">START REPEAT GROUP_DSET_ALL</span>
      } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (strcmp(buffer, <span style="color: #8b2252;">"rank_$group_dset$"</span>) == 0) {

        rc = fscanf(f, <span style="color: #8b2252;">"%u"</span>, &amp;($group$-&gt;rank_$group_dset$));
        <span style="color: #a020f0;">if</span> (rc != 1) {
          trexio_text_free_read_$group$(buffer, f, file, $group$);
          <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
        }

        <span style="color: #a020f0;">if</span> ($group$-&gt;rank_$group_dset$ != 0) size_$group_dset$ = 1UL;

        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;$group$-&gt;rank_$group_dset$; ++i){

          <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">j</span>=0;
          rc = fscanf(f, <span style="color: #8b2252;">"%1023s %u"</span>, buffer, &amp;j);
          <span style="color: #a020f0;">if</span> ((rc != 2) || (strcmp(buffer, <span style="color: #8b2252;">"dims_$group_dset$"</span>) != 0) || (j!=i)) {
            trexio_text_free_read_$group$(buffer, f, file, $group$);
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
          }

          rc = fscanf(f, <span style="color: #8b2252;">"%"</span> SCNu64 <span style="color: #8b2252;">"\n"</span>, &amp;($group$-&gt;dims_$group_dset$[i]));
          assert(!(rc != 1));
          <span style="color: #a020f0;">if</span> (rc != 1) {
            trexio_text_free_read_$group$(buffer, f, file, $group$);
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
          }

          size_$group_dset$ *= $group$-&gt;dims_$group_dset$[i];
        }
      // <span style="color: #b22222;">END REPEAT GROUP_DSET_ALL</span>
      // <span style="color: #b22222;">START REPEAT GROUP_DSET_NUM</span>
      } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (strcmp(buffer, <span style="color: #8b2252;">"$group_dset$"</span>) == 0) {

        /* <span style="color: #b22222;">Allocate arrays </span>*/
        $group$-&gt;$group_dset$ = CALLOC(size_$group_dset$, $group_dset_dtype$);
        <span style="color: #a020f0;">if</span> ($group$-&gt;$group_dset$ == <span style="color: #008b8b;">NULL</span>) {
          trexio_text_free_read_$group$(buffer, f, file, $group$);
          <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
        }

        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;size_$group_dset$ ; ++i) {
          rc = fscanf(f, <span style="color: #8b2252;">"%$group_dset_format_scanf$"</span>, &amp;($group$-&gt;$group_dset$[i]));
          <span style="color: #a020f0;">if</span> (rc != 1) {
            trexio_text_free_read_$group$(buffer, f, file, $group$);
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
          }
        }

      // <span style="color: #b22222;">END REPEAT GROUP_DSET_NUM</span>
      // <span style="color: #b22222;">START REPEAT GROUP_DSET_STR</span>
      } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (strcmp(buffer, <span style="color: #8b2252;">"$group_dset$"</span>) == 0) {

        <span style="color: #a020f0;">if</span> (size_$group_dset$ != 0) {
          /* <span style="color: #b22222;">Allocate arrays </span>*/
          $group$-&gt;$group_dset$ = CALLOC(size_$group_dset$, $group_dset_dtype$);
          <span style="color: #a020f0;">if</span> ($group$-&gt;$group_dset$ == <span style="color: #008b8b;">NULL</span>) {
            trexio_text_free_read_$group$(buffer, f, file, $group$);
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
          }

          /* <span style="color: #b22222;">WARNING: this tmp array allows to avoid allocation of space for each element of array of string</span>
<span style="color: #b22222;">           * BUT it's size has to be number_of_str*max_len_str where max_len_str is somewhat arbitrary, e.g. 32.</span>
<span style="color: #b22222;">           </span>*/
          <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">tmp_$group_dset$</span>;
          tmp_$group_dset$ = CALLOC(size_$group_dset$*32, <span style="color: #228b22;">char</span>);

          <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;size_$group_dset$ ; ++i) {
            $group$-&gt;$group_dset$[i] = tmp_$group_dset$;
            /* <span style="color: #b22222;">conventional fcanf with "%s" only return the string before the first space character</span>
<span style="color: #b22222;">             * to read string with spaces use "%[^\n]" possible with space before or after, i.e. " %[^\n]"</span>
<span style="color: #b22222;">             </span>*/
            rc = fscanf(f, <span style="color: #8b2252;">" %1023[^\n]"</span>, buffer);
            <span style="color: #a020f0;">if</span> (rc != 1) {
              trexio_text_free_read_$group$(buffer, f, file, $group$);
              <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
            }

            <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">tmp_$group_dset$_len</span> = strlen(buffer);
            strncpy(tmp_$group_dset$, buffer, 32);
            tmp_$group_dset$ += tmp_$group_dset$_len + 1;
          }
        }

      // <span style="color: #b22222;">END REPEAT GROUP_DSET_STR</span>
      // <span style="color: #b22222;">START REPEAT GROUP_NUM</span>
      } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (strcmp(buffer, <span style="color: #8b2252;">"$group_num$_isSet"</span>) == 0) {

        <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> $group_num$_isSet;
        /* <span style="color: #b22222;">additional parameter $group_num$_isSet is needed to suppress warning when fscanf into bool variable using %u or %d </span>*/
        rc = fscanf(f, <span style="color: #8b2252;">"%u"</span>, &amp;($group_num$_isSet));
        $group$-&gt;$group_num$_isSet = (bool) $group_num$_isSet;
        <span style="color: #a020f0;">if</span> (rc != 1) {
          trexio_text_free_read_$group$(buffer, f, file, $group$);
          <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
        }

        <span style="color: #a020f0;">if</span> ($group$-&gt;$group_num$_isSet == <span style="color: #008b8b;">true</span>) {

          rc = fscanf(f, <span style="color: #8b2252;">"%1023s"</span>, buffer);
          <span style="color: #a020f0;">if</span> ((rc != 1) || (strcmp(buffer, <span style="color: #8b2252;">"$group_num$"</span>) != 0)) {
            trexio_text_free_read_$group$(buffer, f, file, $group$);
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
          }

          rc = fscanf(f, <span style="color: #8b2252;">"%$group_num_format_scanf$"</span>, &amp;($group$-&gt;$group_num$));
          <span style="color: #a020f0;">if</span> (rc != 1) {
            trexio_text_free_read_$group$(buffer, f, file, $group$);
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
          }

        }

      // <span style="color: #b22222;">END REPEAT GROUP_NUM</span>
      // <span style="color: #b22222;">START REPEAT GROUP_ATTR_STR</span>
      } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (strcmp(buffer, <span style="color: #8b2252;">"len_$group_str$"</span>) == 0) {

        rc = fscanf(f, <span style="color: #8b2252;">"%"</span> SCNu64 <span style="color: #8b2252;">""</span>, &amp;($group$-&gt;len_$group_str$));
        <span style="color: #a020f0;">if</span> (rc != 1) {
          trexio_text_free_read_$group$(buffer, f, file, $group$);
          <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
        }

        rc = fscanf(f, <span style="color: #8b2252;">"%1023s"</span>, buffer);
        <span style="color: #a020f0;">if</span> ((rc != 1) || (strcmp(buffer, <span style="color: #8b2252;">"$group_str$"</span>) != 0)) {
          trexio_text_free_read_$group$(buffer, f, file, $group$);
          <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
        }

        <span style="color: #a020f0;">if</span> ($group$-&gt;len_$group_str$ != 0) {

          $group$-&gt;$group_str$ = CALLOC($group$-&gt;len_$group_str$, <span style="color: #228b22;">char</span>);
          <span style="color: #a020f0;">if</span> ($group$-&gt;$group_str$ == <span style="color: #008b8b;">NULL</span>) {
            trexio_text_free_read_$group$(buffer, f, file, $group$);
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
          }

          rc = fscanf(f, <span style="color: #8b2252;">" %1023[^\n]"</span>, buffer);
          <span style="color: #a020f0;">if</span> (rc != 1) {
            trexio_text_free_read_$group$(buffer, f, file, $group$);
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
          }
          /* <span style="color: #b22222;">Safer string conversion to avoid buffer overflow in fscanf </span>*/
          strncpy($group$-&gt;$group_str$, buffer, $group$-&gt;len_$group_str$);

        }
      // <span style="color: #b22222;">END REPEAT GROUP_ATTR_STR</span>
      } <span style="color: #a020f0;">else</span> {
        <span style="color: #a020f0;">continue</span>;
      }

    }

    FREE(buffer);
    fclose(f);
    f = <span style="color: #008b8b;">NULL</span>;
  }

  file-&gt;$group$ = $group$;
  <span style="color: #a020f0;">return</span> $group$;
}
</pre>
</div>
</div>
</div>
