templator_text.html

<div id="outline-container-org01ace0c" class="outline-2">
<h2 id="org01ace0c"><span class="section-number-2">6</span> Template for text has a group</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_has_$group$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  /* <span style="color: #b22222;">Flush the group to make sure the group.txt file is created </span>*/
  <span style="color: #a020f0;">if</span> (file-&gt;mode != <span style="color: #8b2252;">'r'</span>) {
    <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = trexio_text_flush_$group$((<span style="color: #228b22;">trexio_text_t</span>*) file);
    <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }

  /* <span style="color: #b22222;">Build the file name </span>*/
  <span style="color: #228b22;">char</span> $group$_full_path[TREXIO_MAX_FILENAME_LENGTH];

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* $group$_file_name = <span style="color: #8b2252;">"/$group$.txt"</span>;

  strncpy ($group$_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  strncat ($group$_full_path, $group$_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen($group$_file_name));

  <span style="color: #a020f0;">if</span> ($group$_full_path[TREXIO_MAX_FILENAME_LENGTH-1] != <span style="color: #8b2252;">'\0'</span>) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">file_exists</span>;
  file_exists = trexio_text_file_exists($group$_full_path);

  <span style="color: #a020f0;">if</span> (file_exists) {
    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_HAS_NOT;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org88164a6" class="outline-2">
<h2 id="org88164a6"><span class="section-number-2">7</span> Template for text flush a group</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_flush_$group$</span> (<span style="color: #228b22;">trexio_text_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #a020f0;">if</span> (file-&gt;parent.mode == <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">return</span> TREXIO_READONLY;

  $group$_t* $group$ = file-&gt;$group$;
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

  <span style="color: #a020f0;">if</span> ($group$-&gt;to_flush == 0) <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

  assert (file-&gt;parent.mode == <span style="color: #8b2252;">'w'</span> || file-&gt;parent.mode == <span style="color: #8b2252;">'u'</span>);

  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen($group$-&gt;file_name, <span style="color: #8b2252;">"w"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  /* <span style="color: #b22222;">Write the dimensioning variables </span>*/
  // <span style="color: #b22222;">START REPEAT GROUP_DSET_ALL</span>
  fprintf(f, <span style="color: #8b2252;">"rank_$group_dset$ %u\n"</span>, $group$-&gt;rank_$group_dset$);
  // <span style="color: #b22222;">workaround for the case of missing blocks in the file</span>
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">size_$group_dset$</span> = 0;
  <span style="color: #a020f0;">if</span> ($group$-&gt;rank_$group_dset$ != 0) size_$group_dset$ = 1;

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0; i&lt;$group$-&gt;rank_$group_dset$; ++i){
    fprintf(f, <span style="color: #8b2252;">"dims_$group_dset$ %u %"</span> PRIu64 <span style="color: #8b2252;">"\n"</span>, i, $group$-&gt;dims_$group_dset$[i]);
    size_$group_dset$ *= $group$-&gt;dims_$group_dset$[i];
  }
  // <span style="color: #b22222;">END REPEAT GROUP_DSET_ALL</span>

  // <span style="color: #b22222;">START REPEAT GROUP_NUM</span>
  fprintf(f, <span style="color: #8b2252;">"$group_num$_isSet %u \n"</span>, $group$-&gt;$group_num$_isSet);
  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_num$_isSet == <span style="color: #008b8b;">true</span>) fprintf(f, <span style="color: #8b2252;">"$group_num$ %$group_num_format_printf$ \n"</span>, $group$-&gt;$group_num$);
  // <span style="color: #b22222;">END REPEAT GROUP_NUM</span>

  // <span style="color: #b22222;">START REPEAT GROUP_ATTR_STR</span>
  fprintf(f, <span style="color: #8b2252;">"len_$group_str$ %"</span> PRIu64 <span style="color: #8b2252;">"\n"</span>, $group$-&gt;len_$group_str$);
  fprintf(f, <span style="color: #8b2252;">"$group_str$\n"</span>);
  <span style="color: #a020f0;">if</span> ($group$-&gt;len_$group_str$ != 0) fprintf(f, <span style="color: #8b2252;">"%s\n"</span>, $group$-&gt;$group_str$);
  // <span style="color: #b22222;">END REPEAT GROUP_ATTR_STR</span>

  /* <span style="color: #b22222;">Write arrays </span>*/
  // <span style="color: #b22222;">START REPEAT GROUP_DSET_ALL</span>

  fprintf(f, <span style="color: #8b2252;">"$group_dset$\n"</span>);
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;size_$group_dset$ ; ++i) {
    fprintf(f, <span style="color: #8b2252;">"%$group_dset_format_printf$\n"</span>, $group$-&gt;$group_dset$[i]);
  }
  // <span style="color: #b22222;">END REPEAT GROUP_DSET_ALL</span>

  fclose(f);
  $group$-&gt;to_flush = 0;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc7ec18" class="outline-2">
<h2 id="orgcc7ec18"><span class="section-number-2">8</span> Template for text free memory</h2>
<div class="outline-text-2" id="text-8">
<p>
Memory is allocated when reading. The following function frees memory.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_free_$group$</span> (<span style="color: #228b22;">trexio_text_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #a020f0;">if</span> (file-&gt;parent.mode != <span style="color: #8b2252;">'r'</span>) {
    <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = trexio_text_flush_$group$(file);
    <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }

  $group$_t* $group$ = file-&gt;$group$;
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

  // <span style="color: #b22222;">START REPEAT GROUP_DSET_NUM</span>
  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_dset$ != <span style="color: #008b8b;">NULL</span>) FREE ($group$-&gt;$group_dset$);
  // <span style="color: #b22222;">END REPEAT GROUP_DSET_NUM</span>

  // <span style="color: #b22222;">START REPEAT GROUP_DSET_STR</span>
  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_dset$ != <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">if</span> ($group$-&gt;rank_$group_dset$ != 0) FREE ($group$-&gt;$group_dset$[0]);
    FREE ($group$-&gt;$group_dset$);
  }
  // <span style="color: #b22222;">END REPEAT GROUP_DSET_STR</span>

  // <span style="color: #b22222;">START REPEAT GROUP_ATTR_STR</span>
  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_str$ != <span style="color: #008b8b;">NULL</span>) FREE ($group$-&gt;$group_str$);
  // <span style="color: #b22222;">END REPEAT GROUP_ATTR_STR</span>

  FREE ($group$);
  file-&gt;$group$ = <span style="color: #008b8b;">NULL</span>;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

}
</pre>
</div>

<p>
This function is called upon the non-successful exit from the <code>trexio_text_read_group</code> function.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_free_read_$group$</span> (<span style="color: #228b22;">char</span>* <span style="color: #a0522d;">buffer</span>, <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">txt_file</span>, <span style="color: #228b22;">trexio_text_t</span>* <span style="color: #a0522d;">trexio_file</span>, $group$_t* $group$)
{
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc_free</span>;

  FREE(buffer);
  fclose(txt_file);
  /* <span style="color: #b22222;">Set pointer to the struct so that the garbage collector can do the job on file handle </span>*/
  trexio_file-&gt;$group$ = $group$;
  rc_free = trexio_text_free_$group$(trexio_file);
  assert(rc_free == TREXIO_SUCCESS);

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>
</div>
</div>
