templator_text.html
<div id="outline-container-org1da7d57" class="outline-2">
<h2 id="org1da7d57"><span class="section-number-2">13</span> Template for has/read/write the dataset of sparse data</h2>
<div class="outline-text-2" id="text-13">
<p>
Each sparse array is stored in a separate <code>.txt</code> file due to the fact that sparse I/O has to be decoupled
from conventional write/read/flush behaviour of the TEXT back end. Chunks are used to read/write sparse data
to prevent memory overflow. Chunks have a given <code>int64_t size</code>
(size specifies the number of sparse data items, e.g. integrals).
</p>

<p>
User provides indices and values of the sparse array as two separate variables.
</p>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_write_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>,
                                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_start</span>,
                                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span>* <span style="color: #a0522d;">index_sparse</span>,
                                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">value_sparse</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  /* <span style="color: #b22222;">Build the name of the file with sparse data</span>*/
  /* <span style="color: #b22222;">The $group_dset$.txt is limited to 256 symbols for the moment. What are the chances that it will exceed? </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> $group_dset$_file_name[256] = <span style="color: #8b2252;">"/$group_dset$.txt"</span>;
  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];

  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, $group_dset$_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen($group_dset$_file_name));

  /* <span style="color: #b22222;">Open the file in "a" (append) mode to guarantee that no truncation happens upon consecutive writes </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen(file_full_path, <span style="color: #8b2252;">"a"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Specify the line length in order to offset properly. For example, for 4-index quantities</span>
<span style="color: #b22222;">     the line_length is 69 because 10 per index + 4 spaces + 24 for floating point value + 1 for the new line char.</span>
<span style="color: #b22222;">     CURRENTLY NO OFFSET IS USED WHEN WRITING !</span>
<span style="color: #b22222;">    </span>*/
  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">line_length</span> = 0L;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">format_str</span>[256];

  /* <span style="color: #b22222;">Determine the optimal type for storing indices depending on the size_max (usually mo_num or ao_num) </span>*/
  <span style="color: #a020f0;">if</span> (size_max &lt; UINT8_MAX) {
    line_length = $sparse_line_length_8$; // <span style="color: #b22222;">41 for 4 indices</span>
    strncpy(format_str, $sparse_format_printf_8$, 256);
  } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (size_max &lt; UINT16_MAX) {
    line_length = $sparse_line_length_16$; // <span style="color: #b22222;">49 for 4 indices</span>
    strncpy(format_str, $sparse_format_printf_16$, 256);
  } <span style="color: #a020f0;">else</span> {
    line_length = $sparse_line_length_32$; //<span style="color: #b22222;">69 for 4 indices</span>
    strncpy(format_str, $sparse_format_printf_32$, 256);
  }
  strncat(format_str, <span style="color: #8b2252;">"\n"</span>, 2);

  /* <span style="color: #b22222;">Get the starting position of the IO stream to be written in the .size file.</span>
<span style="color: #b22222;">     This is error-prone due to the fact that for large files (&gt;2 GB) in 32-bit systems ftell will fail.</span>
<span style="color: #b22222;">     One can use ftello function which is adapted for large files.</span>
<span style="color: #b22222;">     For now, we can use front-end-provided size_start, which has been checked for INT64_MAX overflow.</span>
<span style="color: #b22222;">   </span>*/
  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">io_start_pos</span> = size_start * line_length;

  /* <span style="color: #b22222;">Write the data in the file and check the return code of fprintf to verify that &gt; 0 bytes have been written </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0UL; i &lt; (<span style="color: #228b22;">uint64_t</span>) size; ++i) {
    rc = fprintf(f, format_str,
       $group_dset_sparse_indices_printf$,
       *(value_sparse + i));
    <span style="color: #a020f0;">if</span> (rc &lt;= 0) {
      fclose(f);
      <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
    }
  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Append .size to the file_full_path in order to write additional info about the written buffer of data </span>*/
  strncat(file_full_path, <span style="color: #8b2252;">".size"</span>, 6);

  /* <span style="color: #b22222;">Open the new file in "a" (append) mode to append info about the buffer that has been just written </span>*/
  <span style="color: #228b22;">FILE</span> *<span style="color: #a0522d;">f_wSize</span> = fopen(file_full_path, <span style="color: #8b2252;">"a"</span>);
  <span style="color: #a020f0;">if</span> (f_wSize == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Write the buffer_size </span>*/
  rc = fprintf(f_wSize, <span style="color: #8b2252;">"%"</span> PRId64 <span style="color: #8b2252;">" %"</span> PRId64 <span style="color: #8b2252;">"\n"</span>, size, io_start_pos);
  <span style="color: #a020f0;">if</span> (rc &lt;= 0) {
    fclose(f_wSize);
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f_wSize);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> $group$_file_name[256] = <span style="color: #8b2252;">"/$group$.txt"</span>;

  memset (file_full_path, 0, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, $group$_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen($group$_file_name));

  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">file_exists</span> = trexio_text_file_exists(file_full_path);

  /* <span style="color: #b22222;">Create an empty file for the trexio_text_has_group to work </span>*/
  <span style="color: #a020f0;">if</span> (!file_exists) {
    <span style="color: #228b22;">FILE</span> *<span style="color: #a0522d;">fp</span> = fopen(file_full_path, <span style="color: #8b2252;">"ab+"</span>);
    fclose(fp);
  }

  /* <span style="color: #b22222;">Exit upon success </span>*/
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_read_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>,
                                               <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof_read_size</span>,
                                               <span style="color: #228b22;">int32_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">index_sparse</span>,
                                               <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">value_sparse</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (eof_read_size == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;

  /* <span style="color: #b22222;">Build the name of the file with sparse data.</span>
<span style="color: #b22222;">     The $group_dset$.txt is limited to 256 symbols for the moment. What are the chances that it will exceed?</span>
<span style="color: #b22222;">   </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> $group_dset$_file_name[256] = <span style="color: #8b2252;">"/$group_dset$.txt"</span>;
  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];

  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, $group_dset$_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen($group_dset$_file_name));

  /* <span style="color: #b22222;">Open the file in "r" (read) mode to guarantee that no truncation happens upon consecutive reads </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen(file_full_path, <span style="color: #8b2252;">"r"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Specify the line length in order to offset properly. For example, for 4-index quantities</span>
<span style="color: #b22222;">     the line_length is 69 because 10 per index + 4 spaces + 24 for floating point value + 1 for the new line char</span>
<span style="color: #b22222;">   </span>*/
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">line_length</span> = 0UL;
  /* <span style="color: #b22222;">Determine the line length depending on the size_max (usually mo_num or ao_num) </span>*/
  <span style="color: #a020f0;">if</span> (size_max &lt; UINT8_MAX) {
    line_length = $sparse_line_length_8$; // <span style="color: #b22222;">41 for 4 indices</span>
  } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (size_max &lt; UINT16_MAX) {
    line_length = $sparse_line_length_16$; // <span style="color: #b22222;">49 for 4 indices</span>
  } <span style="color: #a020f0;">else</span> {
    line_length = $sparse_line_length_32$; //<span style="color: #b22222;">69 for 4 indices</span>
  }

  /* <span style="color: #b22222;">Offset in the file according to the provided  value of offset_file and optimal line_length </span>*/
  fseek(f, (<span style="color: #228b22;">long</span>) <span style="color: #228b22;">offset_file</span> * <span style="color: #a0522d;">line_length</span>, <span style="color: #a0522d;">SEEK_SET</span>);

  /* <span style="color: #b22222;">Read the data from the file and check the return code of fprintf to verify that &gt; 0 bytes have been read or reached EOF </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">buffer</span>[1024];
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">count</span> = 0UL;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0UL; i &lt; (<span style="color: #228b22;">uint64_t</span>) size; ++i) {

      memset(buffer, 0, <span style="color: #a020f0;">sizeof</span>(buffer));

      <span style="color: #a020f0;">if</span> (fgets(buffer, 1023, f) == <span style="color: #008b8b;">NULL</span>){

        fclose(f);
        *eof_read_size = count;
        <span style="color: #a020f0;">return</span> TREXIO_END;

      } <span style="color: #a020f0;">else</span> {

        rc = sscanf(buffer, <span style="color: #8b2252;">"$group_dset_format_scanf$"</span>,
                    $group_dset_sparse_indices_scanf$,
                    value_sparse + i);
        <span style="color: #a020f0;">if</span> (rc &lt;= 0) {
          fclose(f);
          <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
        }
        count += 1UL;

      }
  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_read_$group_dset$_size</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">size_max</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  /* <span style="color: #b22222;">Build the name of the file with sparse data.</span>
<span style="color: #b22222;">     The $group_dset$.txt is limited to 256 symbols for the moment. What are the chances that it will exceed?</span>
<span style="color: #b22222;">   </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> $group_dset$_file_name[256] = <span style="color: #8b2252;">"/$group_dset$.txt.size"</span>;
  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];

  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, $group_dset$_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen($group_dset$_file_name));

  /* <span style="color: #b22222;">Open the file in "r" (read) mode to guarantee that no truncation happens upon consecutive reads </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen(file_full_path, <span style="color: #8b2252;">"r"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;


  /* <span style="color: #b22222;">Read the data from the file and check the return code of fprintf to verify that &gt; 0 bytes have been read or reached EOF </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;
  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_item</span>, <span style="color: #a0522d;">offset_item</span>, <span style="color: #a0522d;">size_accum</span>=0L;

  /* <span style="color: #b22222;">Read the values from the file. BEWARE OF POSSIBLE MAX_INT64 OVERFLOW ! </span>*/
  <span style="color: #a020f0;">while</span>(fscanf(f, <span style="color: #8b2252;">"%"</span> SCNd64 <span style="color: #8b2252;">" %"</span> SCNd64 <span style="color: #8b2252;">""</span>, &amp;size_item, &amp;offset_item) != EOF) {
    /* <span style="color: #b22222;">Check that summation will not overflow the int64_t value </span>*/
    <span style="color: #a020f0;">if</span> (INT64_MAX - size_accum &gt; size_item) {
      size_accum += size_item;
    } <span style="color: #a020f0;">else</span> {
      fclose(f);
      *size_max = -1L;
      <span style="color: #a020f0;">return</span> TREXIO_INT_SIZE_OVERFLOW;
    }
  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Overwrite the value at the input address and return TREXIO_SUCCESS </span>*/
  *size_max = size_accum;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_has_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  /* <span style="color: #b22222;">Build the name of the file with sparse data.</span>
<span style="color: #b22222;">     The $group_dset$.txt is limited to 256 symbols for the moment. What are the chances that it will exceed?</span>
<span style="color: #b22222;">   </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> $group_dset$_file_name[256] = <span style="color: #8b2252;">"/$group_dset$.txt"</span>;
  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];

  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, $group_dset$_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen($group_dset$_file_name));

  /* <span style="color: #b22222;">Check the return code of access function to determine whether the file with sparse data exists or not </span>*/
  <span style="color: #a020f0;">if</span> (access(file_full_path, F_OK) == 0){
    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_HAS_NOT;
  }
}
</pre>
</div>
</div>
</div>
