templator_text.html

<div id="outline-container-orgf96d954" class="outline-2">
<h2 id="orgf96d954"><span class="section-number-2">14</span> Template for text delete a group (UNSAFE mode)</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_delete_$group$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_text_t</span>* <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_text_t</span>*) file;

  $group$_t* $group$ = trexio_text_read_$group$(f);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span> = remove($group$-&gt;file_name);
  <span style="color: #a020f0;">if</span> (rc == -1) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  $group$-&gt;to_flush = 0;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc_free</span> = trexio_text_free_$group$(f);
  <span style="color: #a020f0;">if</span> (rc_free != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc_free;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>
</div>
</div>
