templator_text.html

<div id="outline-container-orga56afa2" class="outline-2">
<h2 id="orga56afa2"><span class="section-number-2">15</span> Source code for the determinant part</h2>
<div class="outline-text-2" id="text-15">
<p>
Each array is stored in a separate <code>.txt</code> file due to the fact that determinant I/O has to be decoupled
from conventional write/read/flush behaviour of the TEXT back end. Chunks are used to read/write the data
to prevent memory overflow. Chunks have a given <code>int64_t size</code>.
Size specifies the number of data items, e.g. determinants.
</p>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_read_determinant_list</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                                   <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                   <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>,
                                                   <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>,
                                                   <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof_read_size</span>,
                                                   <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">list</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (eof_read_size == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;
  <span style="color: #a020f0;">if</span> (list == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_6;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">determinant_list_file_name</span>[256] = <span style="color: #8b2252;">"/determinant_list.txt"</span>;
  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];

  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, determinant_list_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(determinant_list_file_name));

  /* <span style="color: #b22222;">Open the file in "r" (read) mode to guarantee that no truncation happens upon consecutive reads </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen(file_full_path, <span style="color: #8b2252;">"r"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Specify the line length in order to offset properly.</span>
<span style="color: #b22222;">     Each 64-bit integer takes at most 10 slots and requires one space,</span>
<span style="color: #b22222;">     we have int_num integers per up-spin determinant,</span>
<span style="color: #b22222;">     then this number is doubled because we have the same number for down-spin electrons,</span>
<span style="color: #b22222;">     and then one newline char.</span>
<span style="color: #b22222;">   </span>*/
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">line_length</span> = dims[1]*11UL + 1UL; // <span style="color: #b22222;">10 digits per int64_t bitfield + 1 space = 11 spots + 1 newline char</span>

  /* <span style="color: #b22222;">Offset in the file according to the provided  value of offset_file and optimal line_length </span>*/
  fseek(f, (<span style="color: #228b22;">long</span>) <span style="color: #228b22;">offset_file</span> * <span style="color: #a0522d;">line_length</span>, <span style="color: #a0522d;">SEEK_SET</span>);

  /* <span style="color: #b22222;">Read the data from the file and check the return code of fprintf to verify that &gt; 0 bytes have been read or reached EOF </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;
  /* <span style="color: #b22222;">Declare fixed buffer which will be used to read the determinant string &lt;a1 a2 ... a/\ b1 b2 ... b\/&gt; </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">buffer</span>[1024];
  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">buf_size</span> = <span style="color: #a020f0;">sizeof</span>(buffer);
  /* <span style="color: #b22222;">Parameters to post-process the buffer and to get bit fields integers </span>*/
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">accum</span> = 0UL;
  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">shift_int64</span> = 11U;
  /* <span style="color: #b22222;">Counter for number of elements beind processed </span>*/
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">count</span> = 0UL;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0UL; i &lt; dims[0]; ++i) {

    accum = 0UL;
    memset(buffer, 0, buf_size);

    <span style="color: #a020f0;">if</span> (fgets(buffer, buf_size-1, f) == <span style="color: #008b8b;">NULL</span>){

      fclose(f);
      *eof_read_size = count;
      <span style="color: #a020f0;">return</span> TREXIO_END;

    } <span style="color: #a020f0;">else</span> {

   /* <span style="color: #b22222;">The format string is not anymore static but rather dynamic (the number of ints depend on the mo_num)</span>
<span style="color: #b22222;">      Thus, we parse the buffer string int_num*2 times to get the bit field determinants.</span>
<span style="color: #b22222;">    </span>*/
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">j</span>=0; j &lt; (<span style="color: #228b22;">uint32_t</span>) dims[1]; ++j) {
        rc = sscanf(buffer+accum, <span style="color: #8b2252;">"%10"</span> SCNd64, list + dims[1]*i + j);
        <span style="color: #a020f0;">if</span> (rc &lt;= 0) {
          fclose(f);
          <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
        }
        accum += shift_int64;
      }
      count += 1UL;

    }
  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_read_determinant_coefficient</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                                          <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                          <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>,
                                                          <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>,
                                                          <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof_read_size</span>,
                                                          <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">coeff</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (eof_read_size == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;
  <span style="color: #a020f0;">if</span> (coeff == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_6;

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">coeff_file_name</span>[256];
  memset(coeff_file_name, 0, <span style="color: #a020f0;">sizeof</span>(coeff_file_name));
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">trexio_state</span> = file-&gt;state;

  <span style="color: #a020f0;">if</span> (trexio_state != 0) {
    sprintf(coeff_file_name, <span style="color: #8b2252;">"/determinant_coefficient_state_%"</span> PRId32 <span style="color: #8b2252;">".txt"</span>, trexio_state);
  } <span style="color: #a020f0;">else</span> {
    strncpy(coeff_file_name, <span style="color: #8b2252;">"/determinant_coefficient.txt"</span>, 32);
  }

  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];
  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, coeff_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(coeff_file_name));

  /* <span style="color: #b22222;">Open the file in "r" (read) mode to guarantee that no truncation happens upon consecutive reads </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen(file_full_path, <span style="color: #8b2252;">"r"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Specify the line length in order to offset properly.</span>
<span style="color: #b22222;">     Each double value 24 elements + one newline char.</span>
<span style="color: #b22222;">   </span>*/
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">line_length</span> = 25UL;

  /* <span style="color: #b22222;">Offset in the file according to the provided  value of offset_file and optimal line_length </span>*/
  fseek(f, (<span style="color: #228b22;">long</span>) <span style="color: #228b22;">offset_file</span> * <span style="color: #a0522d;">line_length</span>, <span style="color: #a0522d;">SEEK_SET</span>);

  /* <span style="color: #b22222;">Read the data from the file and check the return code of fprintf to verify that &gt; 0 bytes have been read or reached EOF </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;
  /* <span style="color: #b22222;">Declare fixed buffer which will be used to read the determinant string &lt;a1 a2 ... a/\ b1 b2 ... b\/&gt; </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">buffer</span>[64];
  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">buf_size</span> = <span style="color: #a020f0;">sizeof</span>(buffer);
  /* <span style="color: #b22222;">Counter for number of elements beind processed </span>*/
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">count</span> = 0UL;

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0UL; i &lt; dims[0]; ++i) {

    memset(buffer, 0, buf_size);
    <span style="color: #a020f0;">if</span> (fgets(buffer, buf_size-1, f) == <span style="color: #008b8b;">NULL</span>){

      fclose(f);
      *eof_read_size = count;
      <span style="color: #a020f0;">return</span> TREXIO_END;

    } <span style="color: #a020f0;">else</span> {

      rc = sscanf(buffer, <span style="color: #8b2252;">"%lf"</span>, coeff + i);
      <span style="color: #a020f0;">if</span> (rc &lt;= 0) {
        fclose(f);
        <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
      }
      count += 1UL;

    }
  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_text_read_determinant_coefficient_size</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">size_max</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (size_max == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">coeff_file_name</span>[256];
  memset(coeff_file_name, 0, <span style="color: #a020f0;">sizeof</span>(coeff_file_name));
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">trexio_state</span> = file-&gt;state;

  <span style="color: #a020f0;">if</span> (trexio_state != 0) {
    sprintf(coeff_file_name, <span style="color: #8b2252;">"/determinant_coefficient_state_%"</span> PRId32 <span style="color: #8b2252;">".txt.size"</span>, trexio_state);
  } <span style="color: #a020f0;">else</span> {
    strncpy(coeff_file_name, <span style="color: #8b2252;">"/determinant_coefficient.txt.size"</span>, 64);
  }

  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];
  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, coeff_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(coeff_file_name));

  /* <span style="color: #b22222;">Open the file in "r" (read) mode to guarantee that no truncation happens upon consecutive reads </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen(file_full_path, <span style="color: #8b2252;">"r"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Read the data from the file and check the return code of fprintf to verify that &gt; 0 bytes have been read or reached EOF </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;
  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_item</span>, <span style="color: #a0522d;">size_accum</span>=0L;

  /* <span style="color: #b22222;">Read the values from the file. BEWARE OF POSSIBLE MAX_INT64 OVERFLOW ! </span>*/
  <span style="color: #a020f0;">while</span>(fscanf(f, <span style="color: #8b2252;">"%"</span> SCNd64, &amp;size_item) != EOF) {
    /* <span style="color: #b22222;">Check that summation will not overflow the int64_t value </span>*/
    <span style="color: #a020f0;">if</span> (INT64_MAX - size_accum &gt; size_item) {
      size_accum += size_item;
    } <span style="color: #a020f0;">else</span> {
      fclose(f);
      *size_max = -1L;
      <span style="color: #a020f0;">return</span> TREXIO_INT_SIZE_OVERFLOW;
    }
  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Overwrite the value at the input address and return TREXIO_SUCCESS </span>*/
  *size_max = size_accum;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_write_determinant_list</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>,
                                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>,
                                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">list</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (list == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">determinant_list_file_name</span>[256] = <span style="color: #8b2252;">"/determinant_list.txt"</span>;
  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];

  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, determinant_list_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(determinant_list_file_name));

  /* <span style="color: #b22222;">Open the file in "a" (append) mode to guarantee that no truncation happens upon consecutive writes </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen(file_full_path, <span style="color: #8b2252;">"a"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Write the data in the file and check the return code of fprintf to verify that &gt; 0 bytes have been written </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0UL; i &lt; dims[0]; ++i) {

    /* <span style="color: #b22222;">The loop below is needed to write a line with int bit fields for alpha and beta electrons </span>*/
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">j</span>=0; j &lt; (<span style="color: #228b22;">uint32_t</span>) dims[1]; ++j) {
      rc = fprintf(f, <span style="color: #8b2252;">"%10"</span> PRId64 <span style="color: #8b2252;">" "</span>, *(list + i*dims[1] + j));
      <span style="color: #a020f0;">if</span> (rc &lt;= 0) {
        fclose(f);
        <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
      }
    }
    fprintf(f, <span style="color: #8b2252;">"%s"</span>, <span style="color: #8b2252;">"\n"</span>);

  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Additional part for the trexio_text_has_group to work </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">det_file_name</span>[256] = <span style="color: #8b2252;">"/determinant.txt"</span>;

  memset (file_full_path, 0, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, det_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(det_file_name));

  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">file_exists</span> = trexio_text_file_exists(file_full_path);

  /* <span style="color: #b22222;">Create an empty file for the trexio_text_has_group to work </span>*/
  <span style="color: #a020f0;">if</span> (!file_exists) {
    <span style="color: #228b22;">FILE</span> *<span style="color: #a0522d;">fp</span> = fopen(file_full_path, <span style="color: #8b2252;">"ab+"</span>);
    fclose(fp);
  }

  /* <span style="color: #b22222;">Exit upon success </span>*/
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_write_determinant_coefficient</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                                           <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                           <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>,
                                                           <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>,
                                                           <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">coeff</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (coeff == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">coeff_file_name</span>[256];
  memset(coeff_file_name, 0, <span style="color: #a020f0;">sizeof</span>(coeff_file_name));
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">trexio_state</span> = file-&gt;state;

  <span style="color: #a020f0;">if</span> (trexio_state != 0) {
    sprintf(coeff_file_name, <span style="color: #8b2252;">"/determinant_coefficient_state_%"</span> PRId32 <span style="color: #8b2252;">".txt"</span>, trexio_state);
  } <span style="color: #a020f0;">else</span> {
    strncpy(coeff_file_name, <span style="color: #8b2252;">"/determinant_coefficient.txt"</span>, 32);
  }

  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];
  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, coeff_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(coeff_file_name));

  /* <span style="color: #b22222;">Open the file in "a" (append) mode to guarantee that no truncation happens upon consecutive writes </span>*/
  <span style="color: #228b22;">FILE</span>* <span style="color: #a0522d;">f</span> = fopen(file_full_path, <span style="color: #8b2252;">"a"</span>);
  <span style="color: #a020f0;">if</span> (f == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Write the data in the file and check the return code of fprintf to verify that &gt; 0 bytes have been written </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0UL; i &lt; dims[0]; ++i) {

    rc = fprintf(f, <span style="color: #8b2252;">"%24.16e\n"</span>, *(coeff + i));
    <span style="color: #a020f0;">if</span> (rc &lt;= 0) {
      fclose(f);
      <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
    }

  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Append .size to the file_full_path in order to write additional info about the written buffer of data </span>*/
  strncat(file_full_path, <span style="color: #8b2252;">".size"</span>, 6);

  /* <span style="color: #b22222;">Open the new file in "a" (append) mode to append info about the buffer that has been just written </span>*/
  <span style="color: #228b22;">FILE</span> *<span style="color: #a0522d;">f_wSize</span> = fopen(file_full_path, <span style="color: #8b2252;">"a"</span>);
  <span style="color: #a020f0;">if</span> (f_wSize == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Write the buffer_size </span>*/
  rc = fprintf(f_wSize, <span style="color: #8b2252;">"%"</span> PRIu64 <span style="color: #8b2252;">"\n"</span>, dims[0]);
  <span style="color: #a020f0;">if</span> (rc &lt;= 0) {
    fclose(f_wSize);
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }

  /* <span style="color: #b22222;">Close the TXT file </span>*/
  rc = fclose(f_wSize);
  <span style="color: #a020f0;">if</span> (rc != 0) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  /* <span style="color: #b22222;">Additional part for the trexio_text_has_group to work </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">det_file_name</span>[256] = <span style="color: #8b2252;">"/determinant.txt"</span>;

  memset (file_full_path, 0, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, det_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(det_file_name));

  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">file_exists</span> = trexio_text_file_exists(file_full_path);

  /* <span style="color: #b22222;">Create an empty file for the trexio_text_has_group to work </span>*/
  <span style="color: #a020f0;">if</span> (!file_exists) {
    <span style="color: #228b22;">FILE</span> *<span style="color: #a0522d;">fp</span> = fopen(file_full_path, <span style="color: #8b2252;">"ab+"</span>);
    fclose(fp);
  }

  /* <span style="color: #b22222;">Exit upon success </span>*/
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_has_determinant_list</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">determinant_list_file_name</span>[256] = <span style="color: #8b2252;">"/determinant_list.txt"</span>;
  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];

  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, determinant_list_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(determinant_list_file_name));

  /* <span style="color: #b22222;">Check the return code of access function to determine whether the file with data exists or not </span>*/
  <span style="color: #a020f0;">if</span> (access(file_full_path, F_OK) == 0){
    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_HAS_NOT;
  }
}

<span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_text_has_determinant_coefficient</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">coeff_file_name</span>[256];
  memset(coeff_file_name, 0, <span style="color: #a020f0;">sizeof</span>(coeff_file_name));
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">trexio_state</span> = file-&gt;state;

  <span style="color: #a020f0;">if</span> (trexio_state != 0) {
    sprintf(coeff_file_name, <span style="color: #8b2252;">"/determinant_coefficient_state_%"</span> PRId32 <span style="color: #8b2252;">".txt"</span>, trexio_state);
  } <span style="color: #a020f0;">else</span> {
    strncpy(coeff_file_name, <span style="color: #8b2252;">"/determinant_coefficient.txt"</span>, 32);
  }

  /* <span style="color: #b22222;">The full path to the destination TXT file with sparse data. This will include TREXIO directory name. </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">file_full_path</span>[TREXIO_MAX_FILENAME_LENGTH];
  /* <span style="color: #b22222;">Copy directory name in file_full_path </span>*/
  strncpy (file_full_path, file-&gt;file_name, TREXIO_MAX_FILENAME_LENGTH);
  /* <span style="color: #b22222;">Append name of the file with sparse data </span>*/
  strncat (file_full_path, coeff_file_name,
           TREXIO_MAX_FILENAME_LENGTH-strlen(coeff_file_name));

  /* <span style="color: #b22222;">Check the return code of access function to determine whether the file with data exists or not </span>*/
  <span style="color: #a020f0;">if</span> (access(file_full_path, F_OK) == 0){
    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_HAS_NOT;
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX-CoE</p>
<p class="date">Created: 2022-07-11 Mon 14:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
